EDT_t5/src/Documents/SalesInvoice/SalesInvoice.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SalesInvoice</name>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Product</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT_t5/src/Documents/SalesInvoice/Forms/DocumentForm/Module.bsl
&AtClient
Procedure ItemsQuantityOnChange(Item)
	CurrentData = Items.Items.CurrentData;
	Recalculate(CurrentData);
EndProcedure

&AtClient
Procedure ItemsPriceOnChange(Item)
	CurrentData = Items.Items.CurrentData;
	Recalculate(CurrentData);
EndProcedure


&AtClient
Procedure Recalculate(CurrentData) 
	CurrentData.Amount = CurrentData.Quantity*CurrentData.Price;	
EndProcedure
